InformationRegisters/бит_КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПользовательЛичногоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыКонтактнойИнформации</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/бит_КонтактнаяИнформация/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мКэшЗначений = Новый Структура;
	
	мКэшЗначений.Вставить("Тип", Неопределено);
	мКэшЗначений.Вставить("Вид", Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Ссылка = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	
	Для Каждого Эл Из Список.Отбор.Элементы Цикл
		
		Если Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизЛицо") Тогда
			
			Если Эл.Использование = Истина Тогда
				
				Ссылка = Эл.ПравоеЗначение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураЭлемента = Новый Структура;
	
	СтруктураЭлемента.Вставить("Тип", ПолучитьТипКонтактнойИнформации(мКэшЗначений.Тип));
	СтруктураЭлемента.Вставить("Вид", ПолучитьВидКонтактнойИнформации(мКэшЗначений.Вид));
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента, СтруктураЭлемента", "КонтактнаяИнформация", СтруктураЭлемента), Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	мКэшЗначений.Тип = ТекущиеДанные.Тип;
	мКэшЗначений.Вид = ТекущиеДанные.Вид;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТипКонтактнойИнформации(Тип)
	
	ТипВЗапросе = "";
	
	Если Тип = Перечисления.бит_ТипыКонтактнойИнформации.Адрес Тогда
		
		ТипВЗапросе = "Адрес";
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.Телефон Тогда
		
		ТипВЗапросе = "Телефон";
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		
		ТипВЗапросе = "АдресЭлектроннойПочты";
		
	ИначеЕсли Тип = Перечисления.бит_ТипыКонтактнойИнформации.Другое Тогда
		
		ТипВЗапросе = "Другое";
		
	КонецЕсли;
	
	Возврат ТипВЗапросе;
 
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидКонтактнойИнформации(Вид)
	
	ВидВЗапросе = "";
	
	Если Вид = Справочники.бит_ВидыКонтактнойИнформации.ЮрАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресПоПрописке";
		
	ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ФактАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресПроживания";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ТелефонПроживающего Тогда
		
		ВидВЗапросе = "Телефон";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ИнформАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресДляИнформирования";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ИнострАдресПроживающего Тогда
		
		ВидВЗапросе = "АдресЗапределамиРФ";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ТелефонСлужебныйПроживающего Тогда
		
		ВидВЗапросе = "ТелефонСлужебный";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.EmailПроживающего Тогда
		
		ВидВЗапросе = "Email";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.АдресПрибытияДрРегион Тогда
		
		ВидВЗапросе = "АдресПрибытияИзДругогоРегиона";
		

    ИначеЕсли Вид = Справочники.бит_ВидыКонтактнойИнформации.ДругаяИнформацияПроживающего Тогда
		
		ВидВЗапросе = "ДругаяИнформация";
		
    КонецЕсли;
	
	Возврат ВидВЗапросе;
 
КонецФункции

#КонецОбласти
